<?php

//Видалення застарілого, або неактивного замовлення адміністратором, в разі відмови клієнта від створеного замовлення.

/* Подключаем файл для получения соединения к базе данных (PhpMyAdmin, MySQL) */
require_once '../config/connect.php';

/* Получаем ID продукта из адресной строки */
$id = $_GET['id'];

/* Делаем запрос на удаление строки из таблицы zakaz */

mysqli_query($connect,"DELETE FROM `zakaz_ok` WHERE `zakaz_ok`.`id` = '$id'");

/* Переадресация на стрінку "Робота"*/
header('Location: /index.php');