<?php

//Оновлення інформації про кількість позиції вибраного товару в корзині, файл який змінює кількість товару прямо з корзини.

/* Подключаем файл для получения соединения к базе данных (PhpMyAdmin, MySQL) */
require_once '../config/connect.php';

/* Создаем переменные со значениями, которые были получены с $_POST */
$id = $_POST['id'];
$count = $_POST['count'];

/* Делаем запрос на изменение строки в таблице order, тобто заміни кількості товару */
mysqli_query($connect, "UPDATE `order` SET `count` = $count WHERE `order`.`id` = $id ");

/* Переадресация на  страницу "Чек" */
header('Location:/cat.php');
?>
